// Задайте строку, содержащую латинские буквы в обоих регистрах.
//  Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string input = "aCssFrGFsaseD?-";

// Преобразование всех заглавных букв в строчные
string result = input.ToLower();

System.Console.WriteLine(result);